#Область ПрограммныйИнтерфейс

Функция ПолучитьWSСтруктуру(ТипЗагружаемогоОбъекта, ИмяТипаЗапросаФабрикиXDTO, ПараметрыАвторизации) Экспорт
	WSСтруктура = ИнтеграцияВетисAPIСлужебный.ПолучитьWSСтруктуру(ТипЗагружаемогоОбъекта, ИмяТипаЗапросаФабрикиXDTO, ПараметрыАвторизации);
	Возврат WSСтруктура;
КонецФункции

Функция ФабрикаXDTO_Заявка() Экспорт
	ФабрикаВетисAPI = ИнтеграцияВетисAPIСлужебный.ФабрикаXDTO_Заявка();
	Возврат ФабрикаВетисAPI;
КонецФункции

#КонецОбласти

#Область РаботаСДатамиВыработкиИСроковГодности

Функция ДопустимыеФорматыДат(Продукция, СкоропортящаясяПродукция) Экспорт
	
	Возврат ИнтеграцияВетисAPIСервер.ДопустимыеФорматыДат(Продукция, СкоропортящаясяПродукция);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипыПродукцииСДоступнымВидомПроисхождения() Экспорт
	
	Возврат ИнтеграцияВетисAPIСервер.ТипыПродукцииСДоступнымВидомПроисхождения();
	
КонецФункции

Функция ПродукцияИсключениеИзТипаЖивыеЖивотные() Экспорт
	
	Результат = Новый Массив;
	
	Макет = Справочники.ВидыПродукции.ПолучитьМакет("ИсключенияИзЖивыхЖивотных");
	Для ТекСтр = 2 По Макет.ВысотаТаблицы Цикл
		
		Идентификатор = Макет.Область("R"+ТекСтр+"C2").Текст;
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Результат.Добавить(Идентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция РазрешенныеСтатусыЗаписейСкладскогоЖурналаДляВыполненияОпераций() Экспорт
	
	Возврат Справочники.СтатусыВерсийЗаписейСкладскогоЖурнала.РазрешенныеСтатусыЗаписейСкладскогоЖурналаДляВыполненияОпераций();
	
КонецФункции

#КонецОбласти