#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	мТекущаяДата = ТекущаяДата();
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрКонецПериода 			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрНачалоПериода 			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	
		
	ПараметрКонецПериода.Значение = КонецДня(мТекущаяДата);
	ПараметрКонецПериода.Использование = Истина;
	
	ПараметрНачалоПериода.Значение = мТекущаяДата - 60*24*60*60 + 1;
	ПараметрНачалоПериода.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли