
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		
		ДоступныВсеПредприятия = Ложь;
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			
			ПользМеркурий = Пользователи.ТекущийПользователь().ПользовательСистемыМеркурий;
			
			ЗапрМП = Новый Запрос;
			ЗапрМП.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПредприятияОбслуживаемыеПользователемСрезПоследних.Предприятие КАК Предприятие
			               |ИЗ
			               |	РегистрСведений.ПредприятияОбслуживаемыеПользователем.СрезПоследних КАК ПредприятияОбслуживаемыеПользователемСрезПоследних
			               |ГДЕ
			               |	ПредприятияОбслуживаемыеПользователемСрезПоследних.Пользователь = &ПользМеркурий
			               |	И ПредприятияОбслуживаемыеПользователемСрезПоследних.Используется = ИСТИНА";
			
			
			ЗапрМП.Параметры.Вставить("ПользМеркурий",ПользМеркурий);
			ВыбЗапрМП = ЗапрМП.Выполнить().Выбрать();
			Пока ВыбЗапрМП.Следующий() Цикл
				СписокДоступныхПредприятий.Добавить(ВыбЗапрМП.Предприятие);
			КонецЦикла;	
			
			УстановитьПривилегированныйРежим(Ложь);
			
		Исключение	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пользователя " + Пользователи.ТекущийПользователь() + " не назначен пользователь
			| в системе Меркурий");
			Отказ = Истина;
		КонецПопытки;	
		
	Иначе
		
		ДоступныВсеПредприятия = Истина;
		
	КонецЕсли;	
	
	
	Если РольДоступна("HelpDesk") Тогда
		Если НЕ ДоступныВсеПредприятия Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			"Предприятие",
			СписокДоступныхПредприятий,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		КонецЕсли;
	ИначеЕсли Не РольДоступна("ПолныеПрава") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Предприятие",
		СписокДоступныхПредприятий,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		//	Список, 
		//	"Организация",
		//	мСписокО,
		//	ВидСравненияКомпоновкиДанных.ВСписке,
		//	,
		//	Истина,
		//	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"СтатусДокумента",
		Перечисления.СтатусДокументаСФайламиSAP.УспешноОбработан,
		ВидСравненияКомпоновкиДанных.НеРавно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры
