#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Номер = СокрЛП(Номер);
	
	ЧастиПредставления = Новый Массив;
	ЧастиПредставления.Добавить(НСтр("ru = '%Номер%'"));
	Если ЗначениеЗаполнено(ГоденДо) Тогда
		ЧастиПредставления.Добавить(НСтр("ru = 'до %ГоденДо%'"));
	КонецЕсли;
	
	Представление = СтрСоединить(ЧастиПредставления, " ");
	Представление = СтрЗаменить(Представление, "%Номер%"  , Номер);
	Представление = СтрЗаменить(Представление, "%ГоденДо%", Формат(ГоденДо, "ДФ=dd.MM.yyyy"));
	
	Наименование = Представление;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Номер) И Не ЗначениеЗаполнено(ГоденДо) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							НСтр("ru = 'Необходимо указать либо ""Номер"" либо ""Годен до"".'"),
							ЭтотОбъект,
							,
							,
							Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли