#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда 
		Параметры.Свойство("Организация", Запись.ОрганизацияДляПолученияНСИ);
	Иначе
		Запись.ОрганизацияДляПолученияНСИ = ?(ЗначениеЗаполнено(Запись.ОрганизацияДляПолученияНСИ), Запись.ОрганизацияДляПолученияНСИ, ПараметрыСеанса.ТекущийПользователь.ОсновнаяОрганизация);
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти