
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Параметры = Новый Структура;
	Параметры.Вставить("МассивЗаписей", ПараметрКоманды);
	Параметры.Вставить("Пользователь" , Пользователь);
	
	ДлительнаяОперация = ОбновитьДанныеЗаписейСкладскогоЖурнала(Параметры, Новый УникальныйИдентификатор);
	
	Контекст = Новый Структура;
	Контекст.Вставить("АдресРезультатаОбновленияЗаписей", ДлительнаяОперация.АдресРезультата);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Происходит обновление данных записей складского журнала...'");
	ПараметрыОжидания.ВыводитьОкноОжидания       = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОбновленияДанныхЗаписей", ЭтотОбъект, Контекст);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбновитьДанныеЗаписейСкладскогоЖурнала(Параметры, Идентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление данных записей складского журнала.'");

	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияВетисAPIОбработкаПартий.ОбновитьДанныеЗаписейВФоновомРежиме",
		Параметры, ПараметрыВыполнения);
		
	Возврат ФоновоеЗадание;
КонецФункции

&НаКлиенте
Процедура ВывестиСообщениеОбОшибке(Знач ТекстОшибки)
	ОчиститьСообщения();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеОбновленияДанныхЗаписей(Результат, Контекст) Экспорт

	// Ответ: 
	// - Структура - Выполнено - результат в структуре.
	// - Неопределено - Отменено пользователем.
	Если Результат = Неопределено Тогда
		
		// Освобождаем выделенную память.
		УдалитьИзВременногоХранилища(Контекст.АдресРезультатаОбновленияЗаписей); // Вызов сервера.
		Возврат;
	КонецЕсли;
	
	// В контексте АдресРезультата больше не нужен, теперь он актуализирован в Результат.АдресРезультата.
	Контекст.Удалить("АдресРезультатаОбновленияЗаписей");
	
	// Результат.Статус:
	// - "Ошибка" - описание в ОписаниеОшибки.
	// - "Выполнено" - результат в Результат.АдресРезультата.
	Если Результат.Статус = "Выполнено" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатОперации", Результат.АдресРезультата);
		ПараметрыФормы.Вставить("ЗаголовокФормы"   , НСтр("ru = 'Результат обновления данных по записям складского журнала'"));
		
		ОткрытьФорму("ОбщаяФорма.ФормаРезультатаЗагрузки", ПараметрыФормы);
		
	Иначе
		
		// Освобождаем выделенную память.
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить обновление данных записей складского журнала
			    |по причине:
				|%1'"), Результат.ПодробноеПредставлениеОшибки);
			
		ВывестиСообщениеОбОшибке(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры
