#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

// Возвращает Список разрешенных типов ТТН
// 
// Возвращаемое значение:
//   Массив - массив документов.
//
Функция СписокРазрешенныхТиповТТН() Экспорт
	
	МассивДокументов = Новый Массив;
	
	МассивДокументов.Добавить(ТТН);
	МассивДокументов.Добавить(Конасамент);
	МассивДокументов.Добавить(CMR);
	МассивДокументов.Добавить(Авианакладная);
	МассивДокументов.Добавить(ТранспортнаяНакладная);
	
	Возврат МассивДокументов;
КонецФункции

// Возвращает Список разрешенных документов отгрузки
// 
// Возвращаемое значение:
//  Массив - массив документов.
//
Функция СписокРазрешенныхДокументовОтгрузки() Экспорт
	
	МассивДокументов = Новый Массив;
	
	МассивДокументов.Добавить(ТОРГ12);
	МассивДокументов.Добавить(ВетеринарноеРазрешениеНаИмпортТС);
	МассивДокументов.Добавить(РазрешениеВетУправленияСубъектаСтраныТСНаВвозПродукции);
	МассивДокументов.Добавить(ТОРГ13);
	МассивДокументов.Добавить(ВетСертификатНаПеремещениеВнутриРФ);
	МассивДокументов.Добавить(ВетСертификатТретьихСтранНаВвозПродукцииНаТерриториюРФ);
	МассивДокументов.Добавить(ВетСертификатСтраныТСНаВвозПродукцииНаТерриториюРФ);
	МассивДокументов.Добавить(ВетСертификатРФНаВывозПродукцииНаТерриториюСтранТС);
	МассивДокументов.Добавить(ВетСертификатРФНаВывозПродукцииНаТерриториюТретьихСтран);
	МассивДокументов.Добавить(Заказ);
	МассивДокументов.Добавить(УПД);

	Возврат МассивДокументов;
КонецФункции

#КонецОбласти

#КонецЕсли