
&НаКлиенте
Процедура ПолучателиФизлицоПриИзменении(Элемент)
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	ТекДанные.ЭлПочта = ПолучитьЭлПочту(ТекДанные.Физлицо);
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлПочту( пЧеловек )
	
	Если НЕ ЗначениеЗаполнено(пЧеловек) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(пЧеловек) = Тип("СправочникСсылка.Пользователи") Тогда
		
		лАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта( пЧеловек, Справочники.ВидыКонтактнойИнформации.EmailПользователя );
		Возврат лАдрес;
		
	Иначе
		
		Возврат пЧеловек;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого лСтрокаТЧ Из Объект.Пользователи Цикл
	
		лАдрес = лСтрокаТЧ.ЭлПочта;
		Если ЗначениеЗаполнено(лАдрес)Тогда
			
			Если СтрЧислоВхождений( лАдрес, "@" ) <> 1
				Или Найти( лАдрес, " " ) > 0
				Тогда
				
				лНомерСтроки = Формат( лСтрокаТЧ.НомерСтроки, "ЧГ=" );
				лИндексСтроки = Формат( Объект.Пользователи.Индекс(лСтрокаТЧ), "ЧГ=" );
				лТекстСообщения = НСтр("ru = 'Неправильное значение e-mail в строке №'; en = 'Incorrect e-mail in the line #'") + лНомерСтроки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю( лТекстСообщения, Объект.Ссылка, "Пользователи["+лИндексСтроки+"].ЭлПочта", "Объект", Отказ );
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
