
#Область ОбработкаСправочникаСвойстваЗаписейСкладскогоЖурнала

Функция ЗаписьСкладскогоЖурналаПоДаннымXDTO(ПараметрыПодключения,
											Предприятие,
											ЗаписьСкладскогоЖурналаXDTO,
											ОбновлятьЗапись = Ложь,
											ОбновитьТолькоМероприятия = Ложь,
											ТекстОшибки = "") Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ЗаписьСкладскогоЖурналаПоДаннымXDTO(ПараметрыПодключения, Предприятие, ЗаписьСкладскогоЖурналаXDTO, ОбновлятьЗапись, ОбновитьТолькоМероприятия, ТекстОшибки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ОбработатьРезультатПолученияДанныхОЗаписях(ДанныеОЗаписях, Параметры) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ОбработатьРезультатПолученияДанныхОЗаписях(ДанныеОЗаписях, Параметры);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура АктуализироватьВерсииЗаписейСкладскогоЖурнала(ПараметрыПодключения, Предприятие, ДанныеЗаписейСкладскогоЖурнала, МассивОшибокОбработки) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.АктуализироватьВерсииЗаписейСкладскогоЖурнала(ПараметрыПодключения, Предприятие, ДанныеЗаписейСкладскогоЖурнала, МассивОшибокОбработки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеДанныхЗаписейСкладскогоЖурнала

Процедура ОбновитьДанныеЗаписейВФоновомРежиме(Параметры, АдресРезультата) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ОбновитьДанныеЗаписейВФоновомРежиме(Параметры, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработкаДокументаВСД

Функция ВСДПоДаннымXDTO(ПараметрыПодключения, ВСДXDTO, ДополнительныеПараметры, ТекстОшибки = "") Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ВСДПоДаннымXDTO(ПараметрыПодключения, ВСДXDTO, ДополнительныеПараметры, ТекстОшибки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура СоздатьВходящиеВСДНаОснованииИсходящихВСД(Организация, ТаблицаИсходящихВСД) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.СоздатьВходящиеВСДНаОснованииИсходящихВСД(Организация, ТаблицаИсходящихВСД);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеДанныхВСД

Процедура ПолучитьВСДПоСпискуИдентификаторов(Параметры, АдресРезультата) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ПолучитьВСДПоСпискуИдентификаторов(Параметры, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьДанныеВСДВФоновомРежиме(Параметры, АдресРезультата) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ОбновитьДанныеВСДВФоновомРежиме(Параметры, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаФайловИзМеркурия

Функция ПолучитьПутьПроверкиВСД(GUID_ВСД) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ПолучитьПутьПроверкиВСД(GUID_ВСД);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьПутьДляЗагрузкиФайла(GUID_ВСД) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ПолучитьПутьДляЗагрузкиФайла(GUID_ВСД);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьФайлВетСправки(ВСД) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ПолучитьФайлВетСправки(ВСД);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура ПрисоединитьФайлВетСправкиКВСД(ВСД) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIОбработкаПартий");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ПрисоединитьФайлВетСправкиКВСД(ВСД);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
