#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПоКонтрагентам") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Параметры.ОтборПоКонтрагентам, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	ОбщегоНазначенияУВССервер.ДобавитьЭлементАдресНаФормуСпискаВыбора(ЭтаФорма, "Юридический адрес");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанныхКонтрагента" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискКонтрагентовПоФильтру(Команда)
	
	ОткрытьФорму("Обработка.РасширенныйПоискКонтрагентов.Форма.Форма", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПредприятийХозяйствующегоСубъекта(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Обработка.СписокПредприятийХозяйствующегоСубъекта.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвязьСПредприятиями(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ОбщегоНазначенияУВСВызовСервера.ОрганизацияТекущегоПользователя();
	Контрагент  = ОбщегоНазначенияУВСВызовСервера.КонтрагентПоОрганизации(Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Контрагент" , Контрагент);
	
	ОткрытьФорму("Обработка.ИзменениеСвязиМеждуХозяйствующимСубъектомИПредприятиями.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПарыКонтрагентПредприятиеПоGLN(Команда)
	
	ОткрытьФорму("Обработка.ПоискПоGLN.Форма.Форма", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбщегоНазначенияУВССервер.УстановитьУсловноеОформлениеНеИспользуемыхЭлементов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти