#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗначенияЗависимостей() Экспорт
					
	Набор = РегистрыСведений.ЗависимостиВырабатываемойПродукцииОтСырья.СоздатьНаборЗаписей();
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.МясоИМясопродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.МясоИМясопродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.МясоИМясопродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.МясоИМясопродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ПищевыеПродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.МясоИМясопродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЛекарственныеСредства;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.МясоИМясопродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЖивыеЖивотные;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЛекарственныеСредства;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЖивыеЖивотные;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.РыбаИМорепродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЛекарственныеСредства;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЛекарственныеСредства;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ЛекарственныеСредства;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПищевыеПродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ПищевыеПродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПищевыеПродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЛекарственныеСредства;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.РыбаИМорепродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.РыбаИМорепродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ПищевыеПродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.РыбаИМорепродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.РыбаИМорепродукты;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.РыбаИМорепродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПродукцияНеТребующаяРазрешения;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.КормаИКормовыеДобавки;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПродукцияНеТребующаяРазрешения;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ЛекарственныеСредства;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПродукцияНеТребующаяРазрешения;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.ПищевыеПродукты;
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ТипСырья = Справочники.ТипыПродукции.ПродукцияНеТребующаяРазрешения;
	НоваяЗапись.ТипПродукции = Справочники.ТипыПродукции.НепищевыеПродуктыИДругое;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли