
// Задержка выполнения алгоритма на указанное в параметре количество секунд
// по умолчанию 5 минут (60*5), обусловленное умолчанием задачи отключения пользователей
//
Процедура Пауза(пВремяОжидания = 300) Экспорт
	
	Попытка
		
		scr = Новый COMОбъект("WScript.Shell");
		scr.Run("ping 127.0.0.1 -n " + пВремяОжидания, 0, 1);
	
	Исключение
		
		лОписаниеОшибки = ОписаниеОшибки();
		
		лНачалоОжидания = ТекущаяДата();
		Пока ТекущаяДата() - лНачалоОжидания < пВремяОжидания Цикл
			
			нулл = Степень( 2, 20 );
			
		КонецЦикла;
		
	КонецПопытки;
	
КонецПроцедуры

Функция Степень( Base, Parameter ) Экспорт
	
	m = ?( Parameter >= 0, Parameter, -Parameter );
	r = 1;
	
	For i = 1 To m Do
		r = r * ?( Parameter > 0, Base, 1 / Base);
	EndDo;
	
	Return r;
	
КонецФункции

Процедура ДМ_ПередУдалениемБазовыеПраваПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления Тогда
		Если Не ДМ_СлужебныйВызовСервера.ЕстьРоль( "ПолныеПрава" ) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для пометки к удалению");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДМ_ПередПометкойНаУдалениеСправочникаДляБазовыхПравПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления Тогда
		Если Не ДМ_СлужебныйВызовСервера.ЕстьРоль( "ПолныеПрава" ) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для пометки к удалению");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДМ_ПередЗаписьюДокументаДляБазовыхПравПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не ДМ_СлужебныйВызовСервера.ЕстьРоль( "ПолныеПрава" ) Тогда
		Если ТипЗнч(Источник) <> Тип("ДокументОбъект.КорректировкаОстатковЗаписейСкладскогоЖурнала") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для редактирования документа");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
