#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат
	КонецЕсли;
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаймаутОпросаСервераПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаймаутОпросаСервераОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПопытокОпросаСервераПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПопытокОпросаСервераОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучатьФайлВетеринаронойСправкиПриЗагрузкеВСДПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКонтрольПартийПриНезавершенномПроизводствеПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОпросаЗаявокВСтатусеЗаявкаОбрабатываетсяПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗаявкиПоОкончаниюОпросаЗаявокВСтатусеЗаявкаОбрабатываетсяПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаймаутСоединенияПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПогашенныеИАннулированныеВСДПриИзменении(Элемент)
	
	ЗаписатьОбщиеДанные(Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализацияФормы()
	
	ТаймаутОпросаСервера                                            = Константы.ТаймаутОпросаСервера.Получить();
	КоличествоПопытокОпросаСервера                                  = Константы.КоличествоПопытокОпросаСервера.Получить();
	ПолучатьФайлВетеринарнойСправкиПриЗагрузкеВСД                   = Константы.ПолучатьФайлВетеринарнойСправкиПриЗагрузкеВСД.Получить();
	ИспользоватьКонтрольПартийПриНезавершенномПроизводстве          = Константы.ИспользоватьКонтрольПартийПриНезавершенномПроизводстве.Получить();
	ВремяОпросаЗаявокВСтатусеЗаявкаОбрабатывается                   = Константы.ВремяОпросаЗаявокВСтатусеЗаявкаОбрабатывается.Получить();
	СтатусЗаявкиПоОкончаниюОпросаЗаявокВСтатусеЗаявкаОбрабатывается = Константы.СтатусЗаявкиПоОкончаниюОпросаЗаявокВСтатусеЗаявкаОбрабатывается.Получить();
	ТаймаутСоединения                                               = Константы.ТаймаутСоединения.Получить();
	ЗагружатьПогашенныеИАннулированныеВСД                           = Константы.ЗагружатьПогашенныеИАннулированныеВСД.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбщиеДанные(ИмяРеквизита)
	Константы[ИмяРеквизита].Установить(ЭтаФорма[ИмяРеквизита]);
КонецПроцедуры

#КонецОбласти
