#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВССервер.УстановитьУсловноеОформлениеНеИспользуемыхЭлементов(ЭтаФорма);
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаСервере
Процедура ОбновитьОКОПФНаСервере()
	
	Справочники.КлассификаторОКОПФ.ЗагрузитьЭлементы();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОКОПФ(Команда)
	
	ОбновитьОКОПФНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти 

