#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список разрешенных результатов исследований
// 
// Возвращаемое значение:
//  Массив - список предопределенных элементов 
//
Функция МассивРазрешенныхРезультатовИсследований() Экспорт
	
	МассивРезультатов = Новый Массив;
	
	МассивРезультатов.Добавить(НеПроводилось);
	МассивРезультатов.Добавить(ПодвергнутоСырье);
	МассивРезультатов.Добавить(ПодвергнутаПродукция);
	
	Возврат МассивРезультатов;
КонецФункции

#КонецОбласти

#КонецЕсли