#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = ОбщегоНазначенияУВССервер.КонтрагентПоОрганизации(Запись.Организация);
	ПредыдущаяДата = Запись.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Органиазация

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Контрагент = ОбщегоНазначенияУВСВызовСервера.КонтрагентПоОрганизации(Запись.Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Предприятие

&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	
	ОбщегоНазначенияУВСКлиент.ПредприятиеПриИзменении(Контрагент, Запись.Предприятие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВСКлиент.ПредприятиеНачалоВыбора(Элемент, СтандартнаяОбработка,, Контрагент, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВСКлиент.ПредприятиеАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка,, Контрагент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВСКлиент.ПредприятиеОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка,, Контрагент, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий_Дата

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Запись.ЗагрузкаПрервана Тогда
		
		Оповещение   = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'Предыдущая итерация обмена не завершилась. Продолжить изменение даты?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		Запись.СмещениеПрерывания = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Запись.ЗагрузкаПрервана   = Ложь;
		Запись.СмещениеПрерывания = 0;
		
	Иначе
		
		Запись.Дата = ПредыдущаяДата;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти