#Область ПрограммныйИнтерфейс

// Вызывается при нажатии на гиперссылку или двойном щелчке на ячейке 
// табличного документа с описанием изменений системы (общий макет ОписаниеИзмененийСистемы).
//
// Параметры:
//   Область - ОбластьЯчеекТабличногоДокумента - область документа, на 
//             которой произошло нажатие.
//
Процедура ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(Знач Область) Экспорт
	
	#Область ДанонМеркурий
	
	Если Область.Имя = "ДМ_НачалоРаботы" Тогда
		#Если Не ВебКлиент Тогда
			
			Попытка
				Индификатор = ОбновлениеИнформационнойБазыДМВызовСервера.ПолучитьМакетНачалоРаботы();
				лМакет = ПолучитьИзВременногоХранилища(Индификатор);
				лИмяФайла = ПолучитьИмяВременногоФайла("doc");
				лМакет.Записать(лИмяФайла);
				
				ЗапуститьПриложение( лИмяФайла,, Ложь );
			Исключение
				лОписаниеОшибки = ОписаниеОшибки();
				ВызватьИсключение;
			КонецПопытки;
			
		#КонецЕсли
	КонецЕсли;
	
	#КонецОбласти

КонецПроцедуры

// Вызывается в обработчике ПередНачаломРаботыСистемы, проверяет возможность
// обновления на текущую версию программы.
//
// Параметры:
//  ВерсияДанных - Строка - версия данных основной конфигурации, с которой выполняется обновление
//                          (из регистра сведений ВерсииПодсистем).
//
Процедура ПриОпределенииВозможностиОбновления(Знач ВерсияДанных) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
