#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЗаполнения = Новый Структура;
	РеквизитыЗаполнения.Вставить("БлагополучиеМестности");
	РеквизитыЗаполнения.Вставить("НазначениеГруза");
	РеквизитыЗаполнения.Вставить("НазначениеГрузаДляНекачественнойПродукции");
	РеквизитыЗаполнения.Вставить("ОсуществленКонтрольВрачом");
	РеквизитыЗаполнения.Вставить("ПроводиласьВетсанэкспертиза");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураДанных = Новый Структура;
	Для Каждого ТекРеквизит Из РеквизитыЗаполнения Цикл
		Если УстанавливатьНеЗаполненыеЗначения Или ЗначениеЗаполнено(ЭтотОбъект[ТекРеквизит.Ключ]) Тогда
			Если ТекРеквизит.Ключ = "ОсуществленКонтрольВрачом" И Не ЗначениеЗаполнено(ЭтотОбъект[ТекРеквизит.Ключ]) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДанных.Вставить(ТекРеквизит.Ключ, ЭтотОбъект[ТекРеквизит.Ключ]);
		КонецЕсли;
	КонецЦикла;

	Закрыть(СтруктураДанных);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти