#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
//  ОписанияПрофилей	- Массив
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	// Профиль "Пользователь".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляПользователь();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Общие разрешенные действия для всех пользователей.
              |Пользователь – доступ на просмотр документов; редактирование и запись, проведение документа только по изменению ТС (отдельное поле в документе); доступ на просмотр справочников Контрагенты, Номенклатура, Организации; отсутствие доступа к настройкам пользователей.'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваДМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУВС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСДГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОстатковЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОперацийСводно");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЗагрузкаАктуальныхОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделОтгрузка");
	ОписаниеПрофиля.Роли.Добавить("РазделПоступление");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАннулированийВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАннулированийВСДГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаНачальныхОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДатПоследнихЗагрузокВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаЗагрузкиДанныхПоВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийПредприятийОтветственнымЛицам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковок");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеЗапрещены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "HelpDesk".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "503ab5da-e409-4c90-960e-a77190995cf5";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'HelpDesk'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'HelpDesk – доступ на редактирование (добавление, изменение ролей и данных) списка пользователей и изменение настроек пользователей из группы Пользователь, доступ для просмотра: к документам, объектам системы.'");
	ОписаниеПрофиля.Роли.Добавить("HelpDesk");
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваДМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУВС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСД");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСДГрупповое");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризаций");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОстатковЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаВетисAPI");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурнала");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОпераций");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОперацийСводно");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхОпераций");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	//ОписаниеПрофиля.Роли.Добавить("ОбновлениеКонфигурацииБазыДанных");
	//ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделОтгрузка");
	ОписаниеПрофиля.Роли.Добавить("РазделПоступление");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	//ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	//ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАннулированийВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАннулированийВСДГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаНачальныхОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДатПоследнихЗагрузокВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаВыполненияРегламентныхЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаЗагрузкиДанныхПоВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийПредприятийОтветственнымЛицам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковок");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	
КонецПроцедуры

Функция ИдентификаторПрофиляПользователь() Экспорт

	Возврат НРег("4475757C-61EB-4407-95FB-1C45151FFC22");

КонецФункции // ()

// Возвращает массив групп доступа, назначенных пользователю
//
// Параметры:
//  пПользователь  - СправочникСсылка.Пользователи - пользователь, для которого
//                 определяются группы доступа; если не задано, то будут возвращены группы
//				   доступа текущего пользователя
//
// Возвращаемое значение:
//   Массив   - группы доступа, назначенные пользователю
//
Функция ГруппыДоступаПользователя( пПользователь = Неопределено) Экспорт

	Если пПользователь = Неопределено Тогда
		лПользователь = Пользователи.ТекущийПользователь();
	Иначе
		лПользователь = пПользователь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим( Истина );
	
	лЗапрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь
	|	И ГруппыДоступа.ПометкаУдаления = ЛОЖЬ"
	);
	лЗапрос.УстановитьПараметр( "Пользователь", лПользователь );
	лРезультат = лЗапрос.Выполнить();
	Если лРезультат.Пустой() Тогда
	
		Возврат Новый Массив;
	
	КонецЕсли;
	
	Возврат лРезультат.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ГруппыДоступаПользователя()


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебная фунция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	
КонецПроцедуры

// Переопределяет уровень доступа для пользователя с доступной ролью Администрирование
// Возвращает текущий уровень доступа на изменение свойств пользователя ИБ.
// 
// Параметры:
//  пУровеньДоступа - Структура - со свойствами:
//   * АдминистраторСистемы       - Булево - любые действия с любым пользователем и его пользователем ИБ.
//   * ПолныеПрава                - Булево - то же, АдминистраторСистемы, исключая администраторов системы.
//   * УправлениеСписком          - Булево - добавление новых пользователей и изменение существующих:
//                                   - для пользователей, которым еще не разрешался вход в программу (новых),
//                                     можно настроить любые свойства, кроме включения входа в программу,
//                                   - для пользователей, которым уже разрешался вход в программу,
//                                     можно настроить любые свойства, кроме включения входа в программу
//                                     и настройки аутентификации (см. ниже).
//   * ИзменениеРазрешенияНаВход  - Булево - изменение флажка "Вход в программу разрешен".
//   * ОтключениеРазрешенияНаВход - Булево - снятие    флажка "Вход в программу разрешен".
//   * НастройкиДляВхода          - Булево - изменение свойств пользователя ИБ: Имя, ПользовательОС и
//                                    свойств элемента справочника АутентификацияOpenID, АутентификацияСтандартная,
//                                    АутентификацияОС и Роли (если нет запрета редактирования при внедрении).
//   * ИзменениеТекущего          - Булево - изменение свойств текущего пользователя Пароль и Язык.
//   * НетДоступа                 - Булево - нет ни одного из указанных выше уровней доступа.
//
// Возвращаемое значение:
//  Структура - исходный объект структура "пУровеньДоступа" с откорректированными значенийми свойств
//
Функция УровеньДоступаКСвойствамПользователя( пУровеньДоступа ) Экспорт

	лЕстьРольАдминистрирование = Пользователи.РолиДоступны( "Администрирование",, Ложь );
	Если лЕстьРольАдминистрирование = Истина Тогда
	
		пУровеньДоступа.Вставить("ИзменениеРазрешенияНаВход",	 Истина );
		пУровеньДоступа.Вставить("ОтключениеРазрешенияНаВход",	 Истина );
		пУровеньДоступа.Вставить("НастройкиДляВхода",			 Истина );
		пУровеньДоступа.Вставить("ИзменениеТекущего",			 Истина );
	
	КонецЕсли;
	
	Возврат пУровеньДоступа;

КонецФункции // УровеньДоступаКСвойствамПользователя()


#КонецОбласти