

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Запись.Контрагент = ОбщегоНазначенияУВСВызовСервера.КонтрагентПоОрганизации(Запись.Организация);
КонецПроцедуры


&НаКлиенте
Процедура ПредприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияУВСКлиент.ПредприятиеНачалоВыбора(Элемент, СтандартнаяОбработка, Запись.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеОтправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияУВСКлиент.ПредприятиеНачалоВыбора(Элемент, СтандартнаяОбработка, Запись.Организация, Запись.КонтрагентОтправитель);
КонецПроцедуры

