#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбновлениеИнформационнойБазы

// Монопольный обработчик обновления 2.0.8.1
Процедура ЗаполнитьСправочникСпискомПрав() Экспорт
	
	Макет = ПолучитьМакет("СписокДопустимыхПрав");
	
	Для ТекСтр = 2 По Макет.ВысотаТаблицы Цикл
		
		КодРоли          = Макет.Область("R"+ТекСтр+"C1").Текст;
		НаименованиеРоли = Макет.Область("R"+ТекСтр+"C2").Текст;
		
		НайденнаяРоль = Справочники.ПраваПользователейВСистемеМеркурий.НайтиПоКоду(КодРоли);
		
		Если НайденнаяРоль.Пустая() Тогда
			
			РольОбъект = Справочники.ПраваПользователейВСистемеМеркурий.СоздатьЭлемент();
			
		Иначе
			
			РольОбъект = НайденнаяРоль.ПолучитьОбъект();
			
		КонецЕсли;
		
		РольОбъект.Код = КодРоли;
		РольОбъект.Наименование = НаименованиеРоли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли