#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОбновлениеПоИзменениям.Видимость = Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияКонтрагентов
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияПредприятий
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АктуализацияПродукции;
		
	Элементы.КоличествоПопытокПолученияРезультатаПриОшибкахAPLM.Видимость = Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.ЗагрузкаДанныхПоВСД
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.ЗагрузкаДанныхПоЗаписямСкладскогоЖурнала
		ИЛИ Запись.ВидОперации = Справочники.ВидыОперацийОбменаAPI.АдминистрированиеПользователей;
		
	Элементы.СмещениеДатыНачалаЗагрузки.Видимость = Запись.ВидОперации <> Справочники.ВидыОперацийОбменаAPI.ПолучениеАдреснойИнформации
		И Запись.ВидОперации <> Справочники.ВидыОперацийОбменаAPI.АдминистрированиеПользователей;
	
КонецПроцедуры

#КонецОбласти