#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновлениеДанныхНоменклатураУчетнойСистемы" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СозданиеПродукции(Команда)
	
	ОткрытьФорму("Обработка.СозданиеПродукцииНаОснованииНоменклатурыУчетнойСистемы.Форма.Форма", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбщегоНазначенияУВССервер.УстановитьУсловноеОформлениеСопоставленныхЭлементовЭлементов(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти