#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В Разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	//<УВС
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "Склад");
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "Поступление");
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "Производство");
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "Отгрузка");
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "ЛабораторныеИсследования");
	ОбщегоНазначенияУВССервер.ДобавитьПодсистемуВКоллекцию(Разделы, "УправлениеПользователями");
	//>УВС
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	// Совпадают с разделами дополнительнх обработок
	ОпределитьРазделыСДополнительнымиОбработками(Разделы);
	
КонецПроцедуры

#КонецОбласти
