
&НаКлиенте
Процедура Завершить(Команда)
	
	ВнесенВторойТранспорт = Ложь;
	СтрИскТО = Новый Структура;
	СтрИскТО.Вставить("ТО",ИсхТО);
	мСтр = Объект.ТаблицаМаршрутСледования.НайтиСтроки(СтрИскТО);
	ЕстьПустойТранспорт = Ложь;
	Если мСтр.Количество() > 0 Тогда
		Если ВнесениеВторогоТранспортаБезАннулирования Тогда
			Для мм=0 по мСтр.Количество()-1 Цикл
				ТекСтр = мСтр.Получить(мм);
				Если Не ЗначениеЗаполнено(ТекСтр.ИнформацияОСледующемТранспорте) Тогда
					ЕстьПустойТранспорт = Истина;
				ИначеЕсли ТипЗнч(ТекСтр.ИнформацияОСледующемТранспорте) = Тип("СправочникСсылка.ТипыТранспортныхСредств") Тогда
					ЕстьПустойТранспорт = Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПустойТранспорт Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не везде в маршруте следования указано транспортное средство");
		Возврат;
	Иначе	
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("АдресТЗТаблицаМаршрутСледования",ПолучитьАдресТЗ("ТаблицаМаршрутСледования"));
		ОповеститьОВыборе(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТЗ(АдресТЗТаблицаМаршрутСледования)
	
	Объект.ТаблицаМаршрутСледования.Загрузить(ПолучитьИзВременногоХранилища(АдресТЗТаблицаМаршрутСледования));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТЗ(ИсхТаблЧасть)
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Объект[ИсхТаблЧасть].Выгрузить());
	Возврат АдресХранилища;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсхТО = Параметры.ТО;
	ОбновитьТЗ(Параметры.АдресТЗТаблицаМаршрутСледования);
	ВнесениеВторогоТранспортаБезАннулирования = Параметры.ВнесениеВторогоТранспортаБезАннулирования;
	СтрОтб = Новый Структура;
	СтрОТб.Вставить("ТО",ИсхТО);
	Если Объект.ТаблицаМаршрутСледования.НайтиСтроки(СтрОтб).Количество() = 0 Тогда
		//первоначальное заполнение
		Для Каждого ТекСтр из ИсхТО.ТаблицаМаршрутСледования Цикл
			НовСтр = Объект.ТаблицаМаршрутСледования.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
			НовСтр.ТО = ИсхТО;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ТОСтр.Заголовок = "" + ИсхТО;
	Отбор = Новый Структура;
	Отбор.Вставить("ТО", ИсхТО);
	Элементы.ТаблицаМаршрутСледования.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМаршрутСледованияИнформацияОСледующемТранспортеПриИзменении(Элемент)
	
	Если Элементы.ТаблицаМаршрутСледования.ТекущиеДанные.ТО <> ИсхТО Тогда
		Элементы.ТаблицаМаршрутСледования.ТекущиеДанные.ТО = ИсхТО;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМаршрутСледованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМаршрутСледованияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры




