
#Область ОбработкаСправочникаПродукции

Функция ПолучитьПродукцию(ПараметрыПодключения, СвойстваПродукции, ПодвидПродукции, ТекстОшибки = "") Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ПолучитьПродукцию(ПараметрыПодключения, СвойстваПродукции, ПодвидПродукции, ТекстОшибки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ЗарегистрироватьОбновитьДанныеПродукции(МассивПродукции, Организация, Пользователь, Удалить = Ложь) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ЗарегистрироватьОбновитьДанныеПродукции(МассивПродукции, Организация, Пользователь, Удалить);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьАктуальныеДанныеПоПродукции(МассивПродукции) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.ПолучитьАктуальныеДанныеПоПродукции(МассивПродукции);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура ФоновоеЗаданиеПолучениеСпискаПродукцииПоФильтру(Параметры, АдресРезультата) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ФоновоеЗаданиеПолучениеСпискаПродукцииПоФильтру(Параметры, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьОбновитьДанныеПродукции(ДанныеПродукции, ТекстОшибки = "") Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.СоздатьОбновитьДанныеПродукции(ДанныеПродукции, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

Процедура ФоновоеЗаданиеПолучениеСпискаПродукцииПоСПискуИдентификаторов(Параметры, АдресРезультата) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ФоновоеЗаданиеПолучениеСпискаПродукцииПоСПискуИдентификаторов(Параметры, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

Процедура АктуализацияСправочникаПродукции() Экспорт
	
	Попытка
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.АктуализацияСправочникаПродукции);
	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIПродукция");
	
	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.АктуализацияСправочникаПродукции();
		ДМ_ИнтеграцияВетисAPIСервер.ЗарегистрироватьУспешноеВыполнениеРегЗадания( "АктуализацияСправочникаПродукции" );
	Иначе
		лОписаниеОшибки = "Ошибка создания защищенного объекта конфигурации ИнтеграцияВетисAPIПродукция";
		ДМ_ИнтеграцияВетисAPIСервер.ЗарегистрироватьОшибкуВыполненияРегЗадания( "АктуализацияСправочникаПродукции", лОписаниеОшибки );
	КонецЕсли;
	Исключение
		лОписаниеОшибки = ОписаниеОшибки();
		ДМ_ИнтеграцияВетисAPIСервер.ЗарегистрироватьОшибкуВыполненияРегЗадания( "АктуализацияСправочникаПродукции", лОписаниеОшибки);
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти
