#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВССервер.УстановитьУсловноеОформлениеНеИспользуемыхЭлементов(ЭтаФорма);
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПоКонтрагентам") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Параметры.ОтборПоКонтрагентам, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если Параметры.Свойство("ВозможностьВыбораБезУчетаСвязи") Тогда
		Элементы.ФормаПоказатьСписокБезУчетаСвязи.Видимость = Параметры.ВозможностьВыбораБезУчетаСвязи;
	КонецЕсли;
	
	ОбщегоНазначенияУВССервер.ДобавитьЭлементАдресНаФормуСпискаВыбора(ЭтаФорма, "Юридический адрес");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСписокБезУчетаСвязи(Команда)
	МассивЭлементов = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "Ссылка",,,, БезУчетаСвязи,,);
	БезУчетаСвязи = Не БезУчетаСвязи;
	Элементы.ФормаПоказатьСписокБезУчетаСвязи.Пометка = Не Элементы.ФормаПоказатьСписокБезУчетаСвязи.Пометка;
КонецПроцедуры

#КонецОбласти