#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция ТекущиеПраваПользователя(Организация, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПраваПользователейСистемыМеркурийСрезПоследних.ПравоПользователя КАК ПравоПользователя
		|ИЗ
		|	РегистрСведений.ПраваПользователейСистемыМеркурий.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Пользователь = &Пользователь) КАК ПраваПользователейСистемыМеркурийСрезПоследних
		|ГДЕ
		|	ПраваПользователейСистемыМеркурийСрезПоследних.Используется";
	
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПраваПользователя = Новый Массив;
	
	ПраваПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПравоПользователя");
	
	Возврат ПраваПользователя;
КонецФункции

#КонецОбласти

#КонецЕсли