#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	Результат.Добавить("Владелец");
	Результат.Добавить("Наименование");
	Результат.Добавить("КодТНВЭД");
	Результат.Добавить("НаименованиеНаАнглийскомЯзыке");
	Результат.Добавить("НеИспользуется");
	Результат.Добавить("GUID_Меркурий");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли