
#Область ЗагрузкаАдресногоКлассификатора

Процедура ЗаполнитьАдресаДляИнтерактивногоВыбораМеркурий(Результат, Родитель, Уровень, ДополнительныеПараметры) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIКонтактнаяИнформация");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ЗаполнитьАдресаДляИнтерактивногоВыбораМеркурий(Результат, Родитель, Уровень, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСписокАвтоподбораЧастиАдресаМеркурий(Результат, Текст, Родитель, Уровень) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIКонтактнаяИнформация");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ЗаполнитьСписокАвтоподбораЧастиАдресаМеркурий(Результат, Текст, Родитель, Уровень);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСтруктуруАдреса(Ссылка, Соответствие, ВидКИ) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIКонтактнаяИнформация");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ЗаполнитьСтруктуруАдреса(Ссылка, Соответствие, ВидКИ);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьXDTOАдрес(СтруктураАдрес, СтранаРегистрации, АдресXDTO) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIКонтактнаяИнформация");

	Если Не ОбъектСЛК = Неопределено Тогда
		ОбъектСЛК.ЗаполнитьXDTOАдрес(СтруктураАдрес, СтранаРегистрации, АдресXDTO);
	КонецЕсли;

КонецПроцедуры

Функция КонтактнаяИнформацияВXML(Представление, ТипКИ) Экспорт

	ОбъектСЛК = ОбщегоНазначенияУВССервер.СоздатьОбъектСЛК("ИнтеграцияВетисAPIКонтактнаяИнформация");

	Если Не ОбъектСЛК = Неопределено Тогда
		Возврат ОбъектСЛК.КонтактнаяИнформацияВXML(Представление, ТипКИ);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти
