
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	мТекущаяДата = ТекущаяДата();
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТаблицаДатыОтчета = Новый ТаблицаЗначений;
	ТаблицаДатыОтчета.Колонки.Добавить("ДатаОтчета");
	ТаблицаДатыОтчета.Колонки.Добавить("ДатаПредставление");
	ТаблицаДатыОтчета.Колонки.Добавить("ДатаПорядок");
	
	ПараметрДанныхГлубина 			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Глубина");
	ПараметрДанныхПоТекущейДате 	= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПоТекущейДате");
	ПараметрДанныхПериодНачала 		= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодНачала");
	ПараметрДанныхПериодОкончания 	= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОкончания");
	ПараметрДанныхДатаРасчета	 	= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаРасчета");
	ДатаРасчета                     = ПараметрДанныхДатаРасчета.Значение;
	
	
	Если ПараметрДанныхПоТекущейДате.Использование И ПараметрДанныхПоТекущейДате.Значение Тогда
		//ДатаРасчета = КонецДня((НачалоДня(мТекущаяДата) - 1));
		ДатаРасчета = мТекущаяДата;
	Иначе
		ДатаРасчета = КонецДня(ПараметрДанныхДатаРасчета.Значение);
	КонецЕсли;
	
	ПараметрДанныхДатаРасчета.Значение = ДатаРасчета;
	ПараметрДанныхДатаРасчета.Использование = Истина;
	ПериодОкончания = КонецДня((НачалоДня(мТекущаяДата) - 1));
	ПериодНачала	= НачалоДня(ПериодОкончания);
	ПараметрДанныхПериодОкончания.Значение = ПериодОкончания;
	ПараметрДанныхПериодОкончания.Использование = Истина;

	
	Глубина = 1;
	Инд = 1;
	
	Если Не ЗначениеЗаполнено(ПараметрДанныхГлубина.Значение) Тогда
		ПараметрДанныхГлубина.Значение = Глубина;
	Иначе 
		Глубина = ПараметрДанныхГлубина.Значение;
	КонецЕсли;
	ПараметрДанныхГлубина.Значение = Глубина;
	ПараметрДанныхГлубина.Использование = Истина;
	
	
	Пока Инд <= Глубина Цикл 
		НоваяСтрокаДата = ТаблицаДатыОтчета.Добавить();
		ПериодНачала 	= НачалоДня(ПериодНачала + 1 - Инд);
		НоваяСтрокаДата.ДатаПорядок = Инд;
		НоваяСтрокаДата.ДатаОтчета			= ПериодНачала;
		НоваяСтрокаДата.ДатаПредставление 	= Формат(ПериодНачала, "ДЛФ=D");
		Инд = Инд + 1;
	КонецЦикла;
	ПараметрДанныхПериодНачала.Значение 	 = ПериодНачала;
	ПараметрДанныхПериодНачала.Использование = Истина;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
