#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(Объект.ТипТС);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов") Тогда
		МодульЗапретРедактированияРеквизитовОбъектов = ОбщегоНазначения.ОбщийМодуль("ЗапретРедактированияРеквизитовОбъектов");
		МодульЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	УстановитьВидимость(Объект.ТипТС);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(ТипТС)
	
	Если ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.Автомобильный") Тогда
		
		Элементы.ГруппаАвтомобильный.Видимость    = Истина;
		Элементы.ГруппаАвиатранспортный.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожный.Видимость  = Ложь;
		Элементы.ГруппаМорской.Видимость          = Ложь;
		
	ИначеЕсли ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.Авиатранспортный") Тогда
		
		Элементы.ГруппаАвтомобильный.Видимость    = Ложь;
		Элементы.ГруппаАвиатранспортный.Видимость = Истина;
		Элементы.ГруппаЖелезнодорожный.Видимость  = Ложь;
		Элементы.ГруппаМорской.Видимость          = Ложь;
		
	ИначеЕсли ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.Железнодорожный") Тогда
		
		Элементы.ГруппаАвтомобильный.Видимость    = Ложь;
		Элементы.ГруппаАвиатранспортный.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожный.Видимость  = Истина;
		Элементы.ГруппаМорской.Видимость          = Ложь;
		
	ИначеЕсли ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.МорскойКонтейнер")
		Или ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.МорскойТрюм")
		Или ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.Речной") Тогда
		
		Элементы.ГруппаАвтомобильный.Видимость    = Ложь;
		Элементы.ГруппаАвиатранспортный.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожный.Видимость  = Ложь;
		Элементы.ГруппаМорской.Видимость          = Истина;
		
	ИначеЕсли ТипТС = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.Перегон") Тогда
		
		Элементы.ГруппаАвтомобильный.Видимость    = Ложь;
		Элементы.ГруппаАвиатранспортный.Видимость = Ложь;
		Элементы.ГруппаЖелезнодорожный.Видимость  = Ложь;
		Элементы.ГруппаМорской.Видимость          = Ложь;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов") Тогда
		МодульЗапретРедактированияРеквизитовОбъектовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЗапретРедактированияРеквизитовОбъектовКлиент");
		МодульЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти