#Область ПрограммныйИнтерфейс

#Область ПереопределяемыеФункцииУправленияДоступом

// Заполняет массив структур, которые будут использованы для начального заполнения и
//  восстановления начального заполнения профилей.
//
// Параметры:
//  ОписанияПрофилей	 - Массив	 - добавить описания профилей групп доступа (Структура).
//  ПараметрыОбновления	 - Структура - 
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	
#Область Описание_профиля_ОтветственныйЗаОперацииПоступления
	//Профиль "ОтветственныйЗаОперацииПоступления"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОперацииПоступления";
	ОписаниеПрофиля.Идентификатор = "ceaf8088-c557-11e7-9c95-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за операции поступления'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБезопасности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейМетодовИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрепаратов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБолезней");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийЖивыхЖивотных");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОперацийСводно");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделПоступление");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация приходных операций,
	                                      |оформляются бумажные входящие ВСД,
	                                      |формируются заявки на оформление приходных операций'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаТранспортныеОперации
	//Профиль "ОтветственныйЗаТранспортныеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаТранспортныеОперации";
	ОписаниеПрофиля.Идентификатор = "920d670a-c55e-11e7-9c95-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за транспортные операции'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСДГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУполномоченногоГашения");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекУполномоченногоГашения");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделОтгрузка");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация транспортных операций,
	                                      |добавление и изменение данных по хозяйствующим субъектам и предприятиям,
	                                      |формирование заявок на оформление транспортных операций'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаПроизводственныеОперации
	//Профиль "ОтветственныйЗаПроизводственныеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаПроизводственныеОперации";
	ОписаниеПрофиля.Идентификатор = "920d6709-c55e-11e7-9c95-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за производственные операции'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация производственных операций,
	                                      |добавление и изменение данных по продукции,
	                                      |формирование заявок на оформление производственных операций'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаСкладскиеОперации
	//Профиль "ОтветственныйЗаСкладскиеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаСкладскиеОперации";
	ОписаниеПрофиля.Идентификатор = "920d6708-c55e-11e7-9c95-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за складские операции'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОстатковЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурнала");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ЗагрузкаАктуальныхОстатков");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация инвентаризаций,
	                                      |объединение записей складского журнала, ввод начальных остатков,
										  |загрузка актуальных остатков,
	                                      |формирование заявок на оформление инвентаризаций'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОтветственныйЗаВнесениеЛабораторныхИсследований
	//Профиль "ОтветственныйЗаВнесениеЛабораторныхИсследований"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВнесениеЛабораторныхИсследований";
	ОписаниеПрофиля.Идентификатор = "2c3318af-5d06-11e8-aa61-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за внесение лабораторных исследований'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБезопасности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейМетодовИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрепаратов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБолезней");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийЖивыхЖивотных");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукции");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОпераций");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийСведенийОЛабораторныхИсследованиях");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛабораторныхИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОбИммунизации");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделЛабораторныеИсследования");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется внесение сведений о ветеринарных мероприятиях, проводимых с партией продукции таких,
	                                      |как лабораторные исследования или иммунизации и обработки для живых животных,
	                                      |формируются заявки на оформление лабораторных исследований'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Профили_Операторов

#Область Описание_профиля_ОператорОперацииПоступления
	//Профиль "ОператорОперацииПоступления"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОператорОперацииПоступления";
	ОписаниеПрофиля.Идентификатор = "c3ab9c8b-d78b-11e8-b767-3085a9973d64";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор (операции поступления)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБезопасности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейМетодовИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрепаратов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБолезней");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийЖивыхЖивотных");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОперацийСводно");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделПоступление");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация приходных операций,
	                                      |оформляются бумажные входящие ВСД'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_ОператорТранспортныеОперации
	//Профиль "ОператорТранспортныеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОператорТранспортныеОперации";
	ОписаниеПрофиля.Идентификатор = "c3ab9c8a-d78b-11e8-b767-3085a9973d64";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор (транспортные операции)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБлагополучияМестности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПунктовПерегрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОКарантинировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспорта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированийВСДГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийНомеровТранспортныхСредствГрупповое");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУполномоченногоГашения");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ПроверкаВозможностиОсуществленияПеревозки");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекУполномоченногоГашения");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделОтгрузка");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация транспортных операций,
	                                      |добавление и изменение данных по хозяйствующим субъектам и предприятиям'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОператорПроизводственныеОперации
	//Профиль "ОператорПроизводственныеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОператорПроизводственныеОперации";
	ОписаниеПрофиля.Идентификатор = "c3ab9c8c-d78b-11e8-b767-3085a9973d64";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор (производственные операции)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвойствЗаписейСкладскогоЖурнала");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация производственных операций,
	                                      |добавление и изменение данных по продукции'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОператорСкладскиеОперации
	//Профиль "ОператорСкладскиеОперации"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОператорСкладскиеОперации";
	ОписаниеПрофиля.Идентификатор = "c3ab9c88-d78b-11e8-b767-3085a9973d64";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор (складские операции)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУпаковок");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВСД");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокОстатковЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурнала");
	
	// Отчеты, обработки.
	ОписаниеПрофиля.Роли.Добавить("ЗагрузкаАктуальныхОстатков");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдентификаторовВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвязейМеждуЗаписямиСкладскогоЖурналаИВСД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрированиеНСИИСМеркурий");
	ОписаниеПрофиля.Роли.Добавить("РазделСклад");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется регистрация инвентаризаций,
	                                      |объединение записей складского журнала, ввод начальных остатков,
										  |загрузка актуальных остатков'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ОператорВнесениеЛабораторныхИсследований
	//Профиль "ОператорВнесениеЛабораторныхИсследований"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОператорВнесениеЛабораторныхИсследований";
	ОписаниеПрофиля.Идентификатор = "c3ab9c89-d78b-11e8-b767-3085a9973d64";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор (внесение лабораторных исследований)'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСвойствЗаписейСкладскогоЖурнала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБезопасности");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейМетодовИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрепаратов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейБолезней");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийЖивыхЖивотных");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформацииУчетнойСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукции");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОпераций");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенийСведенийОЛабораторныхИсследованиях");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛабораторныхИсследований");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОбИммунизации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЖурналаРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвижениеПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДопустимыхФорматовДатПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделЛабораторныеИсследования");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется внесение сведений о ветеринарных мероприятиях, проводимых с партией продукции таких,
	                                      |как лабораторные исследования или иммунизации и обработки для живых животных'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#КонецОбласти

#Область Описание_профиля_АдминистраторХС
	//Профиль "АдминистраторХС"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторХС";
	ОписаниеПрофиля.Идентификатор = "763c8db8-d791-11e8-abf6-9c5c8ebed0b0";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор ХС'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователейСистемыМеркурий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравПользователейВСистемеМеркурий");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПредприятий");
	
	// Документы, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдминистрированияПользователей");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАдминистрированияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаВетисAPI");
	
	// Команды.
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПротоколаОбмена");
	
	// Видимые подсистемы КИ.
	ОписаниеПрофиля.Роли.Добавить("РазделУправлениеПользователями");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под этим профилем осуществляется администрирование собственных пользователей в ИС ""Меркурий""'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебная фунция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	// Запуск 1С:Предприятия
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУВС");
	
	// Задачи и задания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	// Подсистема печать
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Текущие дела
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
КонецПроцедуры

#КонецОбласти