#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеОбмена") Тогда
		
		ДанныеОбмена = Параметры.ДанныеОбмена;
		
		Если ДанныеОбмена <> Неопределено Тогда
			
			Если ДанныеОбмена.Свойство("ИдентификаторЗаявки") Тогда
				ИдентификаторЗаявки = ДанныеОбмена.ИдентификаторЗаявки;
			КонецЕсли;
			КодСостоянияСервера     = ДанныеОбмена.КодСостоянияСервера;
			СтатусЗаявки            = ДанныеОбмена.СтатусЗаявки;
			ТекстОшибки             = ДанныеОбмена.ТекстОшибки;
			ТекстЗапросаФормированияЗаявки.УстановитьТекст(ДанныеОбмена.ТекстЗапросаФормированияЗаявки);
			ТекстОтветаПолучениеРезультата.УстановитьТекст(ДанныеОбмена.ТекстОтветаПолучениеРезультата);
			
		КонецЕсли;
		
		Элементы.ТекстОтветаФормированияЗаявки.Видимость   = Ложь;
		Элементы.ТекстЗапросаПолучениеРезультата.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("РезультатОбработкиЗаявки") Тогда
		
		РезультатОбработкиЗаявки = Параметры.РезультатОбработкиЗаявки;
		
		Если РезультатОбработкиЗаявки <> Неопределено Тогда
			
			Если РезультатОбработкиЗаявки.Свойство("ИдентификаторЗаявки") Тогда
				ИдентификаторЗаявки = РезультатОбработкиЗаявки.ИдентификаторЗаявки;
			КонецЕсли;
			КодСостоянияСервера     = РезультатОбработкиЗаявки.КодСостояния;
			СтатусЗаявки            = РезультатОбработкиЗаявки.Статус;
			Если РезультатОбработкиЗаявки.Свойство("ТекстОшибки") Тогда
				ТекстОшибки         = РезультатОбработкиЗаявки.ТекстОшибки;
			ИначеЕсли РезультатОбработкиЗаявки.Свойство("ОписаниеОшибки") Тогда
				ТекстОшибки         = РезультатОбработкиЗаявки.ОписаниеОшибки;
			КонецЕсли;
			ТекстЗапросаФормированияЗаявки.УстановитьТекст(РезультатОбработкиЗаявки.ТекстЗапроса);
			ТекстОтветаПолучениеРезультата.УстановитьТекст(РезультатОбработкиЗаявки.ТекстОтвета);
			
		КонецЕсли;
		
		Элементы.ТекстОтветаФормированияЗаявки.Видимость   = Ложь;
		Элементы.ТекстЗапросаПолучениеРезультата.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("РезультатФормированияЗапроса") Тогда
		
		РезультатФормированияЗапроса = Параметры.РезультатФормированияЗапроса;
		
		Если ТипЗнч(РезультатФормированияЗапроса) = Тип("Структура") Тогда
			
			Если РезультатФормированияЗапроса.Свойство("ИдентификаторЗаявки") Тогда
				ИдентификаторЗаявки        = РезультатФормированияЗапроса.Результат;
			КонецЕсли;
			КодСостоянияСервера            = РезультатФормированияЗапроса.КодСостояния;
			СтатусЗаявки                   = РезультатФормированияЗапроса.Статус;
			ТекстОшибки                    = РезультатФормированияЗапроса.ОписаниеОшибки;
			ТекстЗапросаФормированияЗаявки.УстановитьТекст(РезультатФормированияЗапроса.ТекстЗапроса);
			ТекстОтветаФормированияЗаявки.УстановитьТекст(РезультатФормированияЗапроса.ТекстОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("РезультатПолученияОтвета") Тогда
		
		РезультатПолученияОтвета = Параметры.РезультатПолученияОтвета;
		
		Если ТипЗнч(РезультатПолученияОтвета) = Тип("Структура") Тогда
			
			Если РезультатПолученияОтвета.Свойство("ИдентификаторЗаявки") Тогда
				ИдентификаторЗаявки         = РезультатПолученияОтвета.ИдентификаторЗаявки;
			КонецЕсли;
			КодСостоянияСервера             = РезультатПолученияОтвета.КодСостояния;
			СтатусЗаявки                    = РезультатПолученияОтвета.Статус;
			ТекстОшибки                     = РезультатПолученияОтвета.ТекстОшибки;
			ТекстЗапросаПолучениеРезультата.УстановитьТекст(РезультатПолученияОтвета.ТекстЗапроса);
			ТекстОтветаПолучениеРезультата.УстановитьТекст(РезультатПолученияОтвета.ТекстОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти