#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУВССервер.УстановитьУсловноеОформлениеНеИспользуемыхЭлементов(ЭтаФорма);
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПоПредприятиям") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Параметры.ОтборПоПредприятиям, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если Параметры.Свойство("ВозможностьВыбораБезУчетаСвязи") Тогда
		Элементы.ФормаПоказатьСписокБезУчетаСвязи.Видимость = Параметры.ВозможностьВыбораБезУчетаСвязи;
	Иначе
		Элементы.ФормаПоказатьСписокБезУчетаСвязи.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияУВССервер.ДобавитьЭлементАдресНаФормуСпискаВыбора(ЭтаФорма, "Адрес предприятия");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСписокБезУчетаСвязи(Команда)
	МассивЭлементов = ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Список.Отбор, "Ссылка",,,, БезУчетаСвязи,,);
	БезУчетаСвязи = Не БезУчетаСвязи;
	Элементы.ФормаПоказатьСписокБезУчетаСвязи.Пометка = Не Элементы.ФормаПоказатьСписокБезУчетаСвязи.Пометка;
КонецПроцедуры

#КонецОбласти