// Выполняет регистрацию ошибки выполнения регламентного задания интеграции с ВетисAPI
//
// Параметры:
//  пИмяРегламентногоЗадания  - Строка - имя регламентного задания, как
//                 оно задано в конфигураторе
//  пОписаниеОшибки  - Строка - описание ошибки
//  пПараметрыЗадания  - Структура - структура параметров метода
//                 регламентного задания
//
Процедура ЗарегистрироватьОшибкуВыполненияРегЗадания( пИмяРегламентногоЗадания, пОписаниеОшибки, пПараметрыЗадания=Неопределено ) Экспорт

	ДМ_СлужебныйПривилегированный.УстановитьКодСостоянияПоказателя( пИмяРегламентногоЗадания, 3, пОписаниеОшибки );

КонецПроцедуры // ЗарегистрироватьОшибкуВыполненияРегЗадания()

// Выполняет регистрацию успешного выполнения регламентного задания интеграции с ВетисAPI
//
// Параметры:
//  пИмяРегламентногоЗадания  - Строка - имя регламентного задания, как
//                 оно задано в конфигураторе
//
Процедура ЗарегистрироватьУспешноеВыполнениеРегЗадания( пИмяРегламентногоЗадания ) Экспорт

	ДМ_СлужебныйПривилегированный.УстановитьКодСостоянияПоказателя( пИмяРегламентногоЗадания, 1 );

КонецПроцедуры // ЗарегистрироватьУспешноеВыполнениеРегЗадания()
