
#Область ПрограммныйИнтерфейс

Функция СформироватьПечатнуюФормуВетеринарнойСправки(ОписаниеКоманды) Экспорт
	
	#Если Не ВебКлиент Тогда
	АдресаПечатныхФорм = УправлениеПечатьюУВСВызовСервера.СформироватьПечатнуюФормуВетеринарнойСправки(ОписаниеКоманды.ОбъектыПечати);
	
	Для Каждого ТекЭлемент Из АдресаПечатныхФорм Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ТекЭлемент.Значение);
		ИмяВременногоФайлаPDF = ПолучитьИмяВременногоФайла("pdf");
		ДвоичныеДанные.Записать(ИмяВременногоФайлаPDF);
		ОбщегоНазначенияКлиент.ЗапуститьПрограмму(ИмяВременногоФайлаPDF);
	КонецЦикла;
	#КонецЕсли
	
КонецФункции

Функция НастройкаПечатиДокументов(ОписаниеКоманды) Экспорт
	
	ОткрытьФорму(
		"РегистрСведений.НастройкиПечатиОбъектов.Форма.НастройкаПечатиДокументов",
		Новый Структура("Объекты", ОписаниеКоманды.ОбъектыПечати));
	
КонецФункции

#КонецОбласти