
#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПередНачаломДобавленияНаСервере(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ РегистрСведений.НастройкиОбменаВетисAPI";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = Не РезультатЗапроса.Пустой();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СписокПередНачаломДобавленияНаСервере(Отказ);
	
	Если Отказ Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Допускается ввод только одной настройки.'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти