
&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	КвоПров = 0;
	КвоНеПров = 0;
	ДокВыб = Документы.АдминистрированиеПользователей.Выбрать();
	Пока ДокВыб.Следующий() Цикл
		Если Не ДокВыб.Проведен И Не ДокВыб.ПометкаУдаления Тогда
			ДокВыбО = ДокВыб.ПолучитьОбъект();
			Попытка
				ДокВыбО.Записать(РежимЗаписиДокумента.Проведение);
				КвоПров = КвоПров + 1;
			Исключение
				КвоНеПров = КвоНеПров + 1;
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	
	
	Если КвоПров > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведено " + КвоПров + " документов");
	КонецЕсли;	
	Если КвоНеПров > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не проведено " + КвоНеПров + " документов");
	КонецЕсли;	
	Если КвоНеПров = 0  и КвоПров = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Все непомеченные к удалению документы проведены");
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокументы(Команда)
	ПровестиДокументыНаСервере();
КонецПроцедуры
