
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИмяВарианта = НеОпределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ИмяВарианта", ИмяВарианта);
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Если ИмяВарианта = "ИсторияСостоянийЗаявок" Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоТекущиеДанные", Ложь);
	ИначеЕсли ИмяВарианта = "СтатистикаПоСтатусамЗаПериод" Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоТекущиеДанные", Ложь);
	ИначеЕсли ИмяВарианта = "ТекущиеСтатусыЗаявок" Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоТекущиеДанные", Истина);
	ИначеЕсли ИмяВарианта = "ЗаявкиСОшибками" Тогда
		Параметры.УстановитьЗначениеПараметра("ТолькоТекущиеДанные", Истина);
	Иначе
		Параметры.УстановитьЗначениеПараметра("ТолькоТекущиеДанные", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли