#Область ОписаниеПеременных

&НаКлиенте
Перем ПроизводительДоНачалаИзменения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СтранаПроисхождения") Тогда
		СтранаПроисхождения = Параметры.СтранаПроисхождения;
	КонецЕсли;
	
	Если Параметры.Свойство("ПродукцияПроизводителя") Тогда
		ПродукцияПроизводителя = Параметры.ПродукцияПроизводителя;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресХранения") Тогда
		ТаблицаИзОбъекта = ПолучитьИзВременногоХранилища(Параметры.АдресХранения);
		ТаблицаПроизводителей.Загрузить(ТаблицаИзОбъекта);
	КонецЕсли;
	
	Элементы.ТаблицаПроизводителей.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаПроизводителей

&НаКлиенте
Процедура ТаблицаПроизводителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(ПродукцияПроизводителя) Тогда
		
		ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПередНачаломДобавления(Элементы.ТаблицаПроизводителейПроизводитель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПриНачалеРедактирования(
		Элементы, "ТаблицаПроизводителей", Элементы.ТаблицаПроизводителейПроизводитель, НоваяСтрока, Копирование, ПроизводительДоНачалаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПередОкончаниемРедактирования(
		ЭтаФорма, "ТаблицаПроизводителей", ПроизводительДоНачалаИзменения, Элемент, НоваяСтрока, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПроизводительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПроизводителей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПроизводительНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПроизводительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПроизводителей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.Предприятия") Тогда
		
		ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПроизводительОбработкаВыбора(
			ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПроизводительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПроизводителей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Производитель) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПроизводительАвтоПодбор(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводителейПроизводительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПроизводителей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Производитель) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВетисAPIКлиент.ПроизводителиПродукцииПроизводительОкончаниеВводаТекста(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ТаблицаПроизводителей);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти