#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	КонтактнаяИнформация.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Результат = ОбщегоНазначенияУВССервер.ПроверитьКорректностьАдреса(ЭтотОбъект, Справочники.ВидыКонтактнойИнформации.АдресПунктаПерегрузки, ТекстОшибки);
	
	Если Не Результат Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
															,
															,
															, Отказ);
		
	КонецЕсли;
														
КонецПроцедуры

#КонецОбласти

#КонецЕсли