#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = НаименованиеПолное;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	GUID_Меркурий = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		ПроверяемыеРеквизиты.Добавить("КоличествоУпаковок");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоУпаковок) Тогда
		ПроверяемыеРеквизиты.Добавить("Упаковка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ПроверяемыеРеквизиты.Добавить("Упаковка");
		ПроверяемыеРеквизиты.Добавить("КоличествоУпаковок");
		ПроверяемыеРеквизиты.Добавить("Количество");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Количество) Тогда
		ПроверяемыеРеквизиты.Добавить("Упаковка");
		ПроверяемыеРеквизиты.Добавить("КоличествоУпаковок");
		ПроверяемыеРеквизиты.Добавить("ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.НоменклатураУчетнойСистемы") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ЭтоГруппа") Тогда
			ВызватьИсключение НСтр("ru = 'Не предусмотрен ввод продукции на основании группы номенклатуры учетной системы.'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли