
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыОтбора = Новый Структура("ВидВСД", ПредопределенноеЗначение("Перечисление.ВидыВСД.Производственный"));
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор",     ПараметрыОтбора);
	ПараметрыФормы.Вставить("Заголовок", "Ветеринарно-сопроводительные документы (производственные ВСД)");
	ПараметрыФормы.Вставить("ВидВСД",    ПредопределенноеЗначение("Перечисление.ВидыВСД.Производственный"));
	ОткрытьФорму("Документ.ВСД.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ПроизводственныеВСД", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти